jetpax/jep-micropython/ports/esp32/boards/IDAQ/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "iDAQ"
#define MICROPY_HW_MCU_NAME "ESP32"
